InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Comment>Поле в котором хранится числовое значение телефонного номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Э_СтатусыЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>Э_СтатусыЛидов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Теплый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Горячий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Холодный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безперспективный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСобытия</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКонтактныеЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВходящееИсходящееСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВходящееИсходящееСобытие</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Э_Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Э_Лиды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IP_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMAIL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветсвенныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Э_СтатусыЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭ_ДатаПоследнегоЗапланированногоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_Регистратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Э_CustomerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ДатаПереходаВКлиента</Name>
					<Comment>Э_Волощук (21.12.2016)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ВыгружатьВБДВиртуальнойАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Э_УправлениеЛидами/Ext/Module.bsl
Функция Э_НайтиЛид(НомерТелефона) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Э_Лиды.Ссылка
	|ИЗ
	|	Справочник.Э_Лиды КАК Э_Лиды
	|ГДЕ
	|	Э_Лиды.НомерТелефона = &НомерТелефона
	|	И Э_Лиды.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НомерТелефона", СокрЛП(НомерТелефона));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	иначе
		Возврат Неопределено;
    КонецЕсли;
КонецФункции // Э_НайтиЛид()
 
Функция Э_СоздатьНайтиЛид(НомерТелефона,ТекКонтрагент,ИмяЗаказчика=Неопределено,IPЗаказчика=Неопределено,ЭлектронныйАдрес=Неопределено,Адрес=Неопределено,ДопИнфо=Неопределено,Ответственный=Неопределено,ИсточникИнформации=Неопределено,CustomerIDВиртуальнойАТС=Неопределено) Экспорт
    Перем ФлУдалосьЗаблокировать,Э_НайденныйЛид,НовыйЛид,ТекОтветственный;
	
	Э_НайденныйЛид=Э_НайтиЛид(НомерТелефона);
	
	Если ЗначениеЗаполнено(Э_НайденныйЛид) Тогда
		НовыйЛид = Э_НайденныйЛид.ПолучитьОбъект();
		 
		Попытка
		      НовыйЛид.Заблокировать();
			  ФлУдалосьЗаблокировать=Истина;
		Исключение
			  ФлУдалосьЗаблокировать=Ложь;
		КонецПопытки;
		   
	Иначе
		НовыйЛид = Справочники.Э_Лиды.СоздатьЭлемент();
		НовыйЛид.Наименование=НомерТелефона;
		 
		ФлУдалосьЗаблокировать=Истина;
		 
	КонецЕсли;
	
	Если ФлУдалосьЗаблокировать Тогда
		Если НЕ ЗначениеЗаполнено(НовыйЛид.Статус) Тогда
		     НовыйЛид.Статус = Перечисления.Э_СтатусыЛидов.Горячий;
		КонецЕсли;	 
		Если НЕ ЗначениеЗаполнено(НовыйЛид.НомерТелефона) и ЗначениеЗаполнено(НомерТелефона)  Тогда
			НовыйЛид.НомерТелефона = НомерТелефона;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовыйЛид.IP_Адрес) и ЗначениеЗаполнено(IPЗаказчика) Тогда
			НовыйЛид.IP_Адрес = IPЗаказчика;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовыйЛид.EMAIL) и ЗначениеЗаполнено(ЭлектронныйАдрес)  Тогда
			НовыйЛид.EMAIL = ЭлектронныйАдрес;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовыйЛид.Адрес) и ЗначениеЗаполнено(Адрес) Тогда
			НовыйЛид.Адрес = Адрес;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовыйЛид.Контрагент) и ЗначениеЗаполнено(ТекКонтрагент)  Тогда
			НовыйЛид.Контрагент = ТекКонтрагент;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовыйЛид.Комментарий) и ЗначениеЗаполнено(ДопИнфо)  Тогда
			НовыйЛид.Комментарий = ДопИнфо;
		КонецЕсли;
		
		ТекОтветственный=?(ЗначениеЗаполнено(Ответственный),Ответственный,ПараметрыСеанса.ТекущийПользователь);
		Если (Не ЗначениеЗаполнено(НовыйЛид.ОтветсвенныйМенеджер) ИЛИ СокрЛП(НовыйЛид.ОтветсвенныйМенеджер)="<Не указан>") и НовыйЛид.ОтветсвенныйМенеджер <> ТекОтветственный Тогда
			НовыйЛид.ОтветсвенныйМенеджер = ТекОтветственный;
		КонецЕсли;
		Э_УправлениеЛидами.Э_ЛидыОпределитьРеквизитКонтрагентЕслиНеЗаполнен(НовыйЛид,НовыйЛид.НомерТелефона);
		
		Если Не ЗначениеЗаполнено(НовыйЛид.Э_ИсточникИнформации) и ЗначениеЗаполнено(ИсточникИнформации) Тогда
		 	НовыйЛид.Э_ИсточникИнформации = ИсточникИнформации;
		КонецЕсли; 
		 		 
		Если СокрЛП(НовыйЛид.Наименование)=СокрЛП(НовыйЛид.НомерТелефона) и ЗначениеЗаполнено(ИмяЗаказчика) Тогда
		     НовыйЛид.Наименование=ИмяЗаказчика;
		КонецЕсли;
		 
		Если НовыйЛид.Модифицированность() Тогда                           
		    НовыйЛид.Записать();
		КонецЕсли; 
				
		Если ЗначениеЗаполнено(НовыйЛид.Ссылка) и ЗначениеЗаполнено(CustomerIDВиртуальнойАТС) и Не ЗначениеЗаполнено(НовыйЛид.Контрагент) и Не ЗначениеЗаполнено(НовыйЛид.КонтактноеЛицо) Тогда
			CustomerID = Строка(CustomerIDВиртуальнойАТС);
			CustomerID = СтрЗаменить(CustomerID, Символы.НПП, "");
			Э_ТелефонияBinotel.Э_ЗаписатьIDКлиентаВСистемеБинотел(CustomerID,, НовыйЛид.Ссылка);
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат НовыйЛид.Ссылка;
КонецФункции                                             
 
Функция Э_ОпределитьДатуПоследнегоЗапланированногоСобытия(Э_Лид);
     Запрос=Новый Запрос;
	 Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	              |	Событие.Дата КАК СобытиеДата
	              |ИЗ
	              |	Документ.Событие КАК Событие
	              |ГДЕ
	              |	Событие.Э_Лид = &Э_Лид
	              |	И НЕ Событие.ПометкаУдаления
	              |	И Событие.СостояниеСобытия = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Событие.Дата УБЫВ";
	 Запрос.УстановитьПараметр("Э_Лид",Э_Лид);			  
	 Результат=Запрос.Выполнить().Выбрать();
	 Если Результат.Следующий() Тогда
	      Возврат Результат.СобытиеДата
	 иначе	
	      Возврат Дата('00010101');
	 КонецЕсли;
КонецФункции 
 
// Функция находит актуальное значение телефона в контакной информации.
Функция ПолучитьТелефонИзКонтактнойИнформацииПервыйНеПустой(Объект) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактнаяИнформация.CRM_НомерТелефона
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
	    Если ЗначениеЗаполнено(РезультатЗапроса.CRM_НомерТелефона) Тогда
		     Возврат СокрЛП(РезультатЗапроса.CRM_НомерТелефона);
		КонецЕсли;
	КонецЦикла; 
	Возврат Неопределено;
КонецФункции // ПолучитьТелефонИзКонтактнойИнформации()
 
Процедура Э_ПередЗаписьюСобытияПередЗаписью_Лиды(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.ВидСобытия=Перечисления.ВидыСобытий.ТелефонныйЗвонок и не Источник.ПометкаУдаления Тогда
		Если Не ЗначениеЗаполнено(Источник.Э_Лид) Тогда
		    
			Э_НомерТелефона=неопределено;
			Если ЗначениеЗаполнено(Источник.КонтактноеЛицо) Тогда
			     Э_НомерТелефона=ПолучитьТелефонИзКонтактнойИнформацииПервыйНеПустой(Источник.КонтактноеЛицо);
			КонецЕсли;
			Если Э_НомерТелефона =Неопределено и ЗначениеЗаполнено(Источник.Контрагент) Тогда
			     Э_НомерТелефона=ПолучитьТелефонИзКонтактнойИнформацииПервыйНеПустой(Источник.Контрагент);
			КонецЕсли;
			Если Э_НомерТелефона =Неопределено и ЗначениеЗаполнено(Источник.КонтактноеЛицоБезКонтрагента) Тогда
			     Э_НомерТелефона=ПолучитьТелефонИзКонтактнойИнформацииПервыйНеПустой(Источник.КонтактноеЛицоБезКонтрагента);
			КонецЕсли;
			Если Э_НомерТелефона <> Неопределено и ЗначениеЗаполнено(Э_НомерТелефона) Тогда
				 				 Источник.Э_Лид=Э_СоздатьНайтиЛид(Э_НомерТелефона,Источник.Контрагент,СокрЛП(Источник.Контрагент),,,,,Источник.Ответственный,Источник.ИсточникИнформацииПриОбращении);
				  
			КонецЕсли;
		КонецЕсли;
		                            
		
		Если (Не ЗначениеЗаполнено(Источник.Контрагент) или ТипЗнч(Источник.Контрагент)=Тип("Строка")) и ЗначениеЗаполнено(Источник.Э_Лид) и ЗначениеЗаполнено(Источник.Э_Лид.Контрагент) Тогда
		    Источник.Контрагент=Источник.Э_Лид.Контрагент;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Источник.Контрагент) и ЗначениеЗаполнено(Источник.Э_Лид) и Не ЗначениеЗаполнено(Источник.Э_Лид.Контрагент) Тогда
			ЛидОбъект=Источник.Э_Лид.ПолучитьОБъект();
			Попытка
			      ЛидОбъект.Заблокировать();
				  ФлУдалосьЗаблокировать=Истина;
			Исключение
				  ФлУдалосьЗаблокировать=Ложь;
			КонецПопытки;
		    Если ФлУдалосьЗаблокировать=Истина Тогда
				ЛидОбъект.Контрагент=Источник.Контрагент;
				Попытка
					ЛидОбъект.Записать();
				исключение
					#Если Клиент Тогда
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Ошибка при попытке записи контрагента ';uk='Помилка при спробі запису контрагента '")+Источник.Контрагент+НСтр("ru=' в карточке лида ';uk=' в картці ліда '")+Источник.Э_Лид+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());      
					#КонецЕсли
				КонецПопытки;
				ЛидОбъект.Разблокировать();
			иначе
			    #Если Клиент Тогда
			    Э_СтруктураДанных=Новый Структура();
			    Э_СтруктураДанных.Вставить("Э_Лид",Источник.Э_Лид);
			    Э_СтруктураДанных.Вставить("КонтрагентДляЗамены",Источник.Контрагент);
			    Оповестить("Э_ПередЗаписьюСобытияПередЗаписью_КонтрагентДляЗамены",Э_СтруктураДанных);
			    #КонецЕсли
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура Э_ПриЗаписиРегистраСведенийКонтактнаяИнформацияПриЗаписи_Лиды(Источник, Отказ, Замещение) Экспорт
	Перем Э_НомерТелефона,Э_Лид,ЛидОбъект,ФлУдалосьЗаблокировать,Э_ЛидКонтрагент_Новый;
	
	Для каждого Запись Из Источник Цикл
		Если Запись.Тип<>Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;
		КонецЕсли;	
		Э_НомерТелефона = Запись.CRM_НомерТелефона;                                                                                                
		Э_Лид=Э_НайтиЛид(Э_НомерТелефона);
		
		Э_ЛидКонтрагент_Новый=Неопределено;
		Э_ЛидКонтактноеЛицо_Новый=Неопределено;
		Если ЗначениеЗаполнено(Э_Лид) Тогда
			Если ТипЗнч(Запись.Объект)=Тип("СправочникСсылка.Контрагенты") и Э_Лид.Контрагент<>Запись.Объект Тогда
				 Э_ЛидКонтрагент_Новый=Запись.Объект;
			иначеЕсли ТипЗнч(Запись.Объект)=Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
				Если Э_Лид.КонтактноеЛицо<>Запись.Объект тогда
					 Э_ЛидКонтактноеЛицо_Новый=Запись.Объект;
				КонецЕслИ;	
				Если Э_Лид.Контрагент<>Запись.Объект.Владелец   Тогда
				     Э_ЛидКонтрагент_Новый=Запись.Объект.Владелец
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Э_ЛидКонтрагент_Новый<>Неопределено или Э_ЛидКонтактноеЛицо_Новый<>Неопределено Тогда
			ЛидОбъект=Э_Лид.ПолучитьОБъект();
			Попытка
			      ЛидОбъект.Заблокировать();
				  ФлУдалосьЗаблокировать=Истина;
			Исключение
				  ФлУдалосьЗаблокировать=Ложь;
			КонецПопытки;
		    Если ФлУдалосьЗаблокировать=Истина Тогда
				Если Э_ЛидКонтрагент_Новый<>Неопределено Тогда
				     ЛидОбъект.Контрагент=Э_ЛидКонтрагент_Новый;
				КонецЕсли;	 
				Если Э_ЛидКонтактноеЛицо_Новый<>Неопределено Тогда
				     ЛидОбъект.КонтактноеЛицо=Э_ЛидКонтактноеЛицо_Новый;
				КонецЕсли;	 
				Если ЛидОбъект.Модифицированность() Тогда
					Попытка
						ЛидОбъект.Записать();
					исключение
						#Если Клиент Тогда
                        ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Ошибка при попытке записи контрагента ';uk='Помилка при спробі запису контрагента '")+Э_ЛидКонтрагент_Новый+""""+?(ЗначениеЗаполнено(Э_ЛидКонтактноеЛицо_Новый),НСтр("ru=' контактного лица ';uk=' контактної особи '")+Э_ЛидКонтактноеЛицо_Новый+"""","")+НСтр("ru=' в карточке лида ';uk=' в картці ліда '")+Э_Лид+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());
                        #КонецЕсли
					КонецПопытки;
				КонецЕсли;	
				ЛидОбъект.Разблокировать();
			иначе                                                      
			    #Если Клиент Тогда
			    Э_СтруктураДанных=Новый Структура();
			    Э_СтруктураДанных.Вставить("Э_Лид",Э_Лид);
			    Э_СтруктураДанных.Вставить("КонтрагентДляЗамены",Э_ЛидКонтрагент_Новый);
				Э_СтруктураДанных.Вставить("КонтактноеЛицоДляЗамены",Э_ЛидКонтактноеЛицо_Новый);
			    Оповестить("Э_ПередЗаписьюСобытияПередЗаписью_КонтрагентДляЗамены",Э_СтруктураДанных);
			    #КонецЕсли
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
 
Процедура Э_ЛидыОпределитьРеквизитКонтрагентЕслиНеЗаполнен(ТекОбъект,НомерТелефона) Экспорт
	Перем ТекКонтрагент,ТекКонтактноеЛицо,ВидОбъектаКонтактнойИнформации;
	
	Если ЗначениеЗаполнено(ТекОбъект.Контрагент) и ЗначениеЗаполнено(ТекОбъект.КонтактноеЛицо) Тогда
	     Возврат;
	КонецЕсли;
	
	ТекКонтрагент=Неопределено;
	ТекКонтактноеЛицо=Неопределено;
	ВидОбъектаКонтактнойИнформации="";
	Э_ТелефонияBinotel.Э_ОпределитьКонтрагентаКонтактноеЛицо(СокрЛП(НомерТелефона), ВидОбъектаКонтактнойИнформации,ТекКонтрагент,ТекКонтактноеЛицо,);
	
	Если ЗначениеЗаполнено(ТекКонтактноеЛицо) и Не ЗначениеЗаполнено(ТекОбъект.КонтактноеЛицо) Тогда
		 ТекОбъект.КонтактноеЛицо=ТекКонтактноеЛицо;
	КонецЕсли;
 	Если ЗначениеЗаполнено(ТекКонтрагент) и Не ЗначениеЗаполнено(ТекОбъект.Контрагент) Тогда
		 ТекОбъект.Контрагент=ТекКонтрагент;
    КонецЕсли;	
КонецПроцедуры

//Автоматически создаем запланированное событие по лиду, согласно его статуса: горящий, холодный, теплый, безперспективный
Процедура Э_СоздатьЗапланированноеСобытиеТелефонныйЗвонокАвтоматическиСогласноСтатусуЛида(Э_Лид, Э_ИзменятьДатуПланированияВСуществующихЗапланированныхСобытиях=Ложь) Экспорт 
	Э_НастройкиБинотел=Э_ТелефонияBinotel.Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Э_НастройкиБинотел.Э_BinotelСоздаватьЗапланированныеСобытияТелефонныйЗвонок Тогда
		Возврат;
	КонецЕсли;
	
	Если Э_Лид.Закрыт Тогда
		Возврат;
	КонецЕсли;
	
	Если Э_Лид.Статус = Перечисления.Э_СтатусыЛидов.Безперспективный или Э_Лид.ПометкаУдаления Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	Событие.Ссылка,
		             |	Событие.Контрагент
		             |ИЗ
		             |	Документ.Событие КАК Событие
		             |ГДЕ
		             |	Событие.Э_Лид = &Э_Лид
		             |	И НЕ Событие.ПометкаУдаления
		             |	И Событие.СостояниеСобытия = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)";
	 	Запрос.УстановитьПараметр("Э_Лид",Э_Лид);
		
		ТекстСообщенияПользователю=НСтр("ru='Виртуальная АТС: Пометка на удаление запланированного события по безперспективному лиду ';uk='Віртуальна АТС: Позначка на видалення запланованої події по безперспективним ліду '")+Э_Лид+"""";     
		РезультатВыборка = Запрос.Выполнить().Выбрать();
		Пока РезультатВыборка.Следующий() Цикл
			Если ЗначениеЗаполнено(РезультатВыборка.Контрагент) Тогда
			     Продолжить;
			КонецЕсли;
		    ДокОбъектСобытие = РезультатВыборка.Ссылка.ПолучитьОбъект();
			ДокОбъектСобытие.СодержаниеСобытия = СокрЛП(ДокОбъектСобытие.СодержаниеСобытия)+?(ЗначениеЗаполнено(ДокОбъектСобытие.СодержаниеСобытия),"
			|","")+ТекстСообщенияПользователю;
			ТекстСообщенияПользователю=ТекстСообщенияПользователю+". "+СокрЛП(РезультатВыборка.Ссылка);
			Попытка
				Если ДокОбъектСобытие.Проведен Тогда
					ДокОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
				иначе
				    ДокОбъектСобытие.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;	
				ДокОбъектСобытие.УстановитьПометкуУдаления(Истина);
		 	    #Если Не Клиент Тогда
				//ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,ДокОбъектСобытие.Ссылка,ТекстСообщенияПользователю ); //bsoft (21.08.2024)
			    #КонецЕсли                                     
			    Э_ТелефонияBinotel.СообщитьИнформацию(ТекстСообщенияПользователю);
			Исключение
				Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось установить пометку удаления по запланированному событию ';uk='Не вдалося встановити позначку видалення по запланованій події '")+ДокОбъектСобытие+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки()+НСтр("ru='. Выполнение процедуры ""Э_СоздатьСобытиеТелефонныйЗвонок"", при отмене запланированного события по безперспективному лиду';uk='. Виконання процедури ""Э_СоздатьСобытиеТелефонныйЗвонок"", при скасуванні запланованої події по безперспективному ліду'"));     
			КонецПопытки;
		КонецЦикла;
	иначе	
		Если Э_Лид.Статус = Перечисления.Э_СтатусыЛидов.Горячий Тогда        
			Э_ПериодПланированияСобытийВДнях = Э_НастройкиБинотел.Э_BinotelПериодСозданияСобитияДляГорячегоЛида ;
		ИначеЕсли Э_Лид.Статус = Перечисления.Э_СтатусыЛидов.Теплый Тогда    
			Э_ПериодПланированияСобытийВДнях = Э_НастройкиБинотел.Э_BinotelПериодСозданияСобитияДляТеплогоЛида;
		ИначеЕсли Э_Лид.Статус = Перечисления.Э_СтатусыЛидов.Холодный Тогда  
			Э_ПериодПланированияСобытийВДнях = Э_НастройкиБинотел.Э_BinotelПериодСозданияСобитияДляХолодногоЛида;
		иначе
			Э_ПериодПланированияСобытийВДнях=0;
		КонецЕсли;			
		НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида = ТекущаяДата()+Э_ПериодПланированияСобытийВДнях*86400;
		Э_BinotelБазовоеВремяДляПланированияЗвонка = Э_НастройкиБинотел.Э_BinotelБазовоеВремяДляПланированияЗвонка;
		Г =  Год(НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида);
		М =  Месяц(НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида);
		Д =  День(НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида);
		Ч =  Час(Э_BinotelБазовоеВремяДляПланированияЗвонка);
		Ми = Минута(Э_BinotelБазовоеВремяДляПланированияЗвонка);
		С =  Секунда(Э_BinotelБазовоеВремяДляПланированияЗвонка);
		НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида = Дата(Г, М, Д, Ч, Ми, С);
		
		НайденноеЗапланированноеСобытиеПоЛиду=Э_ТелефонияBinotel.Э_НайтиЗапланированноеСобытиеПоКонтакту(,,,Э_НастройкиБинотел,Э_Лид);
		ДокОбъектСобытие=Неопределено;
		ТекстСообщенияПользователю=НСтр("ru='Виртуальная АТС: По активному лиду ';uk='Віртуальна АТС: По активному ліду '")+Э_Лид+"""";     
		
		Если НайденноеЗапланированноеСобытиеПоЛиду<>Неопределено и Э_ИзменятьДатуПланированияВСуществующихЗапланированныхСобытиях Тогда
		     Если КонецДня(НайденноеЗапланированноеСобытиеПоЛиду.Дата)<>КонецДня(НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида) Тогда
			      ДокОбъектСобытие=НайденноеЗапланированноеСобытиеПоЛиду.ПолучитьОбъект();
				  Попытка
				      ДокОбъектСобытие.Заблокировать();  
				  Исключение
					  Возврат;
				  КонецПопытки;
				  ДокОбъектСобытие.Разблокировать();
				  ТекстСообщенияПользователю=ТекстСообщенияПользователю+НСтр("ru=' изменено время запланированного звонка с ';uk=' змінено час запланованого дзвінка з '")+СокрЛП(ДокОбъектСобытие.Дата)+НСтр("ru=' на ';uk=' на '")+СокрЛП(НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида)+НСтр("ru=' дней, согласно установленому периоду планирования событий =';uk=' днів, згідно встановленому періоду планування подій ='")+Э_ПериодПланированияСобытийВДнях+НСтр("ru=', согласно статуса лида ';uk=', згідно статуса ліда '")+Э_Лид.Статус+НСтр("ru=' (настройки виртуальной АТС)';uk=' (налаштування віртуальної АТС)'");        
			 	  ДокОбъектСобытие.Дата=НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида;
			 КонецЕсли;
		иначеЕсли НайденноеЗапланированноеСобытиеПоЛиду=Неопределено Тогда 
		  	ДокОбъектСобытие = Документы.Событие.СоздатьДокумент();
			ДокОбъектСобытие.Дата=НачалоСобития_СогласноПериодаСозданияСобытийВЗависимостиОтСтатусаЛида;
			ТекстСообщенияПользователю=ТекстСообщенияПользователю+НСтр("ru=' добавлено запланированное событие на ';uk=' додано заплановану подію на '")+ДокОбъектСобытие.Дата+НСтр("ru=', согласно установленому периоду планирования событий =';uk=', згідно встановленому періоду планування подій ='")+Э_ПериодПланированияСобытийВДнях+НСтр("ru=' дней, согласно статуса лида ';uk=' днів, згідно статуса ліда '")+Э_Лид.Статус+НСтр("ru=' (настройки виртуальной АТС)';uk=' (налаштування віртуальної АТС)'");    
			ДокОбъектСобытие.АдресЭлектроннойПочты = Э_Лид.EMAIL;
			ДокОбъектСобытие.ВидОбъекта = Перечисления.ВидыОбъектовСобытия.Контрагент;
			ДокОбъектСобытие.Э_Лид = Э_Лид;
			ДокОбъектСобытие.Контрагент = Э_Лид.Контрагент;
			ДокОбъектСобытие.Ответственный = Э_Лид.ОтветсвенныйМенеджер;
			ДокОбъектСобытие.СостояниеСобытия = Перечисления.СостоянияСобытий.Запланировано;               
			ДокОбъектСобытие.СодержаниеСобытия = ТекстСообщенияПользователю;
			ДокОбъектСобытие.ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Исходящее;      
			ДокОбъектСобытие.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
		КонецЕсли;
		
		Если ДокОбъектСобытие<>Неопределено Тогда	 
			ДокОбъектСобытие.НачалоСобытия = ДокОбъектСобытие.Дата;
			ДокОбъектСобытие.ОкончаниеСобытия = ДокОбъектСобытие.НачалоСобытия+360;
			Попытка
			    ДокОбъектСобытие.Записать(РежимЗаписиДокумента.Запись);
				#Если Не Клиент Тогда
				//ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,ДокОбъектСобытие.Ссылка,ТекстСообщенияПользователю); //bsoft (21.08.2024)
			    #КонецЕсли
			    Э_ТелефонияBinotel.СообщитьИнформацию(ТекстСообщенияПользователю); 
			Исключение
				Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось записать событие : ';uk='Не вдалось записати подію : '")+ДокОбъектСобытие+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки()+НСтр("ru='. В процедуре ""Э_СоздатьСобытиеТелефонныйЗвонок"", при создании или изменении запланированного события';uk='. В процедурі ""Э_СоздатьСобытиеТелефонныйЗвонок"", при створенні або зміні запланованої події'"));       
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры
 
Процедура Э_ПриЗаписиСправочникЭ_ЛидыПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	Э_Лид = Источник.Ссылка;
	Э_НастройкиБинотел=Э_ТелефонияBinotel.Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Э_Лид.Э_ДатаРегистрации >= Э_НастройкиБинотел.Э_BinotelДатаНачалаОбработкиЛидов Тогда 
		Э_СоздатьЗапланированноеСобытиеТелефонныйЗвонокАвтоматическиСогласноСтатусуЛида(Источник.Ссылка, Истина);
	КонецЕсли;
КонецПроцедуры

Процедура Э_СозданиеСобытийТелефонныйЗвонокПоСтатусамЛидов() Экспорт 
	
	Э_НастройкиБинотел=Э_ТелефонияBinotel.Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
		
	Если Э_НастройкиБинотел<>Неопределено и (НЕ Э_НастройкиБинотел.Э_BinotelИспользоватьФункционалИнтеграции или Не Э_НастройкиБинотел.Э_BinotelСоздаватьЗапланированныеСобытияТелефонныйЗвонок) Тогда
	     Возврат;
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Э_Лиды.Ссылка
		|ИЗ
		|	Справочник.Э_Лиды КАК Э_Лиды
		|ГДЕ
		|	Э_Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Э_Лиды.Закрыт = ЛОЖЬ
		|	И НЕ Э_Лиды.ЭтоГруппа
		|	И Э_Лиды.Э_ДатаРегистрации >= &ДатаНачалаОбработкиЛидов";
	
	Запрос.УстановитьПараметр("ДатаНачалаОбработкиЛидов", Э_НастройкиБинотел.Э_BinotelДатаНачалаОбработкиЛидов);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Э_СоздатьЗапланированноеСобытиеТелефонныйЗвонокАвтоматическиСогласноСтатусуЛида(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

//Э_Волощук (27.09.2019 15:37:56
Процедура Э_ТелефонияПередЗаписьюПредЗаказаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если ЗначениеЗаполнено(Источник.Контрагент) и ТипЗнч(Источник.Контрагент)=тип("СправочникСсылка.Контрагенты") Тогда
	    КонтрагентВПредЗаказе=Источник.Контрагент;
		ИмяЗаказчика=СокрЛП(КонтрагентВПредЗаказе);
	иначе
	    КонтрагентВПредЗаказе=Неопределено;
		ИмяЗаказчика=СокрЛП(Источник.Контрагент);
	КонецЕсли;
	КонтрагентВПредЗаказе=?(ЗначениеЗаполнено(Источник.Контрагент) и ТипЗнч(Источник.Контрагент)=тип("СправочникСсылка.Контрагенты"),Источник.Контрагент,"");
	ТекЭ_Лид=Э_СоздатьНайтиЛид(Источник.Телефон,КонтрагентВПредЗаказе,ИмяЗаказчика,,,Источник.АдресДоставки,,Источник.Ответственный);
	Если Источник.Э_Лид<>ТекЭ_Лид Тогда
	    Источник.Э_Лид=ТекЭ_Лид;
	КонецЕсли;
КонецПроцедуры
//Э_Волощук)
